{
  "name": "Julius Okwe",
  "label": "Software Engineer",
  "base_url": "https://juliusdgenius.github.io",
  "image_path": "portfolio_media/profile.JPG",
  "contact": {
    "email": "ibejulius1@gmail.com",
    "phone": "07047501126",
    "location": "Lagos"
  },
  "summary": {
    "type": "bullets",
    "content": [
      "Core Competencies: Backend development (NestJS, TypeScript, Prisma ORM, PostgreSQL), DevOps practices, and Python/C scripting",
      "Technical Arsenal: Proficient in JavaScript, HTML/CSS, Bash, and modern toolchains",
      "Domain Experience: Agile development, API design, payment gateway integration, and system optimization",
      "Professional Value: Combines scientific rigor with engineering discipline to deliver maintainable, efficient code",
      "Growth Focus: Actively advancing frontend expertise (React) to achieve fullstack proficiency",
      "Mission: Leverage interdisciplinary background to solve complex technical challenges sustainably"
    ]
  },
  "url": "127.0.0.1:5000",
  "social_links": [
    {
      "label": "My Portfolio Website",
      "url": "#",
      "svg_path": "img/globe.svg"
    },
    {
      "label": "YouTube",
      "url": "https://www.youtube.com/@juliusdgenius1",
      "svg_path": "img/youtube.svg"
    },
    {
      "label": "Instagram",
      "url": "https://www.instagram.com/juliusd_genius",
      "svg_path": "img/instagram.svg"
    },
    {
      "label": "Github",
      "url": "https://github.com/JuliusDgenius",
      "svg_path": "img/github.svg"
    }
  ],
  "about": "I'm a curious problem-solver bridging the worlds of science and technology. With a foundational background in Biochemistry and formal training from the ALX Africa Software Engineering program, I bring a unique analytical perspective to software development. Currently contributing to a South African startup revolutionizing waste management, I thrive at the intersection of backend systems and real-world impact. My passion lies in building scalable solutions while continuously expanding my expertise into fullstack development.",
  "work_experience": [
    {
      "company": "Wastedump, Johannesburg, South Africa",
      "position": "Software Engineer",
      "url": "https:/wastedump.com",
      "start_date": "2024",
      "end_date": "present",
      "summary": "As a key member of a globally distributed agile team, I engineered mission-critical backend services for payment, notifications, and collections. I also led frontend/backend integration and enhanced application security through robust authentication measures.",
      "highlights": [
        "Architected and delivered critical backend services from the ground up, including a secure payment processing module, a scalable email notification system, and an automated collections service, forming the backbone of the application's financial operations.",
        "Spearheaded the seamless integration between the frontend and backend systems, ensuring API consistency, optimal data flow, and a responsive, feature-rich user experience.",
        "Enhanced application security by designing and implementing a robust authentication and authorization layer for the subscription service, protecting sensitive user data and controlling access to premium features.",
        "Effectively collaborated in a globally distributed agile team to scope, design, and develop new features, successfully navigating time-zone differences to ensure timely delivery of product milestones."
      ]
    },
    {
      "company": "National Centre for Artificial Intelligence & Robotics",
      "position": "Python with Raspberry Pi Educator",
      "url": "https://ncair.nitda.gov.ng/",
      "start_date": "2024",
      "end_date": "2024",
      "summary": "As a Python and Robotics Educator, I developed and led a project-based curriculum for high school students, mentoring them in building and programming embedded systems with Raspberry Pi Pico. My role involved fostering practical skills in software development, electronics, and problem-solving.",
      "highlights": [
        "Developed and delivered a hands-on, project-based curriculum for high school students on embedded systems using Python and Raspberry Pi Pico.",
        "Mentored a cohort of students in programming fundamentals and electronics, guiding them from concept to completion on multiple robotics and IoT projects.",
        "Fostered a collaborative learning environment that promoted critical thinking, problem-solving, and practical application of software engineering principles in a hardware context.",
        "Provided expert instruction on Python programming for hardware control, GPIO pin management, and interfacing with sensors and actuators."
      ]
    },
    {
      "company": "Releaf Africa, Cross River, Nigeria.",
      "position": "Inventory and Weighbridge Manager",
      "url": "https://www.wereleaf.earth/",
      "start_date": "2021",
      "end_date": "2023",
      "summary": "",
      "highlights": [
        "Managed inventory systems, optimizing material workflows and dispatch accuracy.",
        "Led weighbridge operations, ensuring detailed tracking of raw material receipts.",
        "Operational Oversight: Manage daily logistics operations, including transportation planning, route optimization, and timely delivery of goods.",  
        "Weighbridge Management: Supervise weighbridge activities, ensuring precise vehicle weighing, accurate documentation, and compliance with legal standards.",  
        "Regulatory Compliance: Safety, and environmental regulations for logistics and weighing processes.",  
        "Record-Keeping: Maintain detailed records of shipments, weights, and transactions for audits and reporting."
      ]
    },
    {
      "company": "Evidence Action",
      "position": "Freelance Data Entry Clerk",
      "url": "https://www.evidenceaction.org/",
      "start_date": "2019",
      "end_date": "2021",
      "summary": "Provided accurate and timely data entry support for project operations, ensuring the integrity of records used for payment processing, monitoring & evaluation, and strategic decision-making.",
      "highlights": [
        "Entered and validated large volumes of project data into Excel spreadsheets with a high degree of accuracy.",
        "Collaborated with project teams to ensure data completeness and resolve discrepancies.",
        "Supported payment processing workflows by maintaining up-to-date and error-free records.",
        "Contributed to monitoring and evaluation (M&E) efforts by preparing data for analysis and reporting.",
        "Demonstrated strong attention to detail and confidentiality in handling sensitive project information."
      ]
    }
  ],
  "projects": [
    {
      "title": "Cryptocurrency Portfolio Tracker",
      "summary": "Designed and developed a full-stack cryptocurrency portfolio management application for real-time investment tracking. Tech Stack: React, NestJS, TypeScript, MongoDB, Redis, Docker, Material UI, Chart.js, BullMQ, Jest.",
      "url": "https://cryptofolio-app.vercel.app",
      "highlights": [
        "Built a modern, responsive frontend using React and Material UI, featuring interactive data visualizations with Chart.js and Recharts for portfolio performance, asset allocation, and historical analysis.",
        "Engineered a robust backend with NestJS and TypeScript, implementing secure JWT-based authentication, role-based access control, and 2FA for enhanced security.",
        "Integrated real-time market data from multiple crypto APIs and supported automated balance updates, CSV import/export, and exchange API integration.",
        "Leveraged MongoDB and Redis for efficient data storage and caching, and BullMQ for background job processing.",
        "Implemented comprehensive testing using Jest and Cypress, ensuring high code quality and reliability.",
        "Containerized the application with Docker and orchestrated services using Docker Compose, demonstrating DevOps proficiency.",
        "Followed best practices in code quality with ESLint, Prettier, and TypeScript, and maintained scalable, maintainable codebases across both frontend and backend."
      ],
      "images": [
	      	  {
          	  "img_path": "img/portfolio-screenshots/cryptofolio-screenshot1.png",
		          "caption": "Home Page"
		        },
		        {
		          "img_path": "img/portfolio-screenshots/cryptofolio-screenshot2.png",
          	  "caption": "Portfolio Dashboard View"
        	  },
        	  {
          	  "img_path": "img/portfolio-screenshots/cryptofolio-screenshot3.png",
          	  "caption": "Portfolio Detail View"
        	  }
       ]
    },
    {
      "title": "Terminal Text Editor in C",
      "summary": "Designed and implemented a lightweight terminal-based text editor in C, inspired by the 'kilo' editor.",
      "url": "https://github.com/JuliusDgenius/terminal-text-editor",
      "highlights": [
        "Developed robust terminal I/O handling using low-level POSIX APIs (termios, ioctl, unistd), enabling raw mode input, real-time keypress processing, and dynamic screen rendering.",
        "Engineered custom screen drawing routines for efficient, flicker-free updates and responsive user experience.",
        "Implemented cross-platform window size detection and cursor positioning logic, ensuring compatibility across various terminal environments.",
        "Applied strong debugging and error-handling practices, including graceful recovery from system call failures.",
        "Demonstrated expertise in systems programming, memory management, and Unix/Linux development tools."
      ],
      "images": []
    },
    {
      "title": "BenefitsHub Nigeria",
      "summary": "Designed and developed a full-stack web application connecting Nigerian citizens with government benefits, featuring user authentication, profile management, benefit listings, and an admin dashboard. Tech Stack: Python, Flask, SQLAlchemy, HTML, CSS, JavaScript, Bootstrap, SQLite/PostgreSQL, Git.",
      "url": "https://github.com/JuliusDgenius/alx-portfolio_project",
      "highlights": [
        "Engineered robust backend services using Flask and SQLAlchemy ORM, implementing RESTful routes, secure authentication, and role-based access for citizens and government agencies.",
        "Built responsive, user-friendly interfaces with HTML, CSS, JavaScript, and Bootstrap, ensuring accessibility and seamless experience across devices.",
        "Integrated search, filtering, and application workflows, enabling users to efficiently discover and apply for government benefits.",
        "Automated deployment and managed environment configuration, leveraging best practices in version control (Git), database migrations, and environment management.",
        "Centralized access to government benefits for Nigerian citizens, streamlining the application process and improving transparency.",
        "Demonstrated ability to deliver end-to-end solutions, from requirements gathering to deployment and user support."
      ],
      "images": []
    },
    {
      "title": "Real-Time Collaborative Document Editor",
      "summary": "Designed and developed a full-stack real-time collaborative document editing platform, enabling multiple users to edit documents simultaneously with instant updates and conflict resolution. Tech Stack: Node.js, Express, Socket.io, Prisma, PostgreSQL, JWT, React, Jest.",
      "url": "https://github.com/JuliusDgenius/real-time-document-editor",
      "highlights": [
        "Architected a scalable backend using Node.js, Express, and Prisma ORM, implementing efficient document versioning and optimistic concurrency control to ensure data consistency during concurrent edits.",
        "Engineered real-time communication with Socket.io, supporting room-based broadcasting and low-latency synchronization of document changes across all connected clients.",
        "Implemented secure JWT-based authentication and role-based access control, safeguarding user sessions and document access.",
        "Developed a modern, responsive frontend with React, providing intuitive document editing and real-time collaboration features.",
        "Wrote comprehensive automated tests with Jest to ensure reliability and maintainability of both backend and real-time features.",
        "Followed best practices in code quality, modular architecture, and error handling, resulting in a robust and maintainable codebase."
      ],
      "images": []
    },
    {
      "title": "A Country Search App",
      "summary": "Developed a web app for viewing information snippets for any country in the world. Tech Stack: JavaScript, HTML and CSS",
      "url": "https://country-search-app-orpin.vercel.app/",
      "highlights": [
        "A responsive web application using plain 'ol vanilla JavaScript and the fetch API for external API call.",
        "Made external API calls to fetch country specific information",
        "Expertly handled API response data and display same on the web page"
      ],
      "images": [
	      	  {
          	  "img_path": "img/portfolio-screenshots/country-app1.png",
		          "caption": "Home Page"
		        },
		        {
		          "img_path": "img/portfolio-screenshots/country-app2.png",
          	  "caption": "Portfolio Dashboard View"
        	  },
        	  {
          	  "img_path": "img/portfolio-screenshots/country-app2.png",
          	  "caption": "Portfolio Detail View"
        	  }
       ]
    }
  ],
  "volunteer_experience": [
    {
      "organization": "First Referral Hospital, Mutum Biyu.",
      "position": "Laboratory Assistant & Medical Records Officer",
      "url": "https://thehospitalbook.com/first-referral-hospital/",
      "start_date": "2018",
      "end_date": "2020",
      "summary": "Initially leveraged my biochemistry background to support laboratory operations with patient testing, then transitioned to the medical records department where I managed sensitive patient data for over 10,000 individuals, showcasing adaptability and a commitment to data integrity.",
      "highlights": [
        "Applied scientific knowledge in a clinical laboratory setting to assist with diagnostic testing and sample processing.",
        "Successfully transitioned roles to manage and maintain the hospital's patient information system, ensuring accuracy and confidentiality.",
        "Contributed to the efficient operation of both clinical and administrative functions in a high-volume hospital environment."
      ]
    },
    {
      "organization": "Nissis Vessels and Raphas Hands Foundations",
      "position": "Logistics Coordinator",
      "url": "https://nissi.foundation",
      "start_date": "2018",
      "end_date": "2018",
      "summary": "Served as a Logistics Coordinator for a critical medical outreach mission providing aid to displaced Cameroonian refugees. Coordinated the distribution of medical supplies and supported a multidisciplinary team of healthcare professionals.",
      "highlights": [
        "Managed the end-to-end logistics for the distribution of essential medical supplies in a challenging, resource-constrained environment.",
        "Collaborated effectively with a diverse team of doctors, nurses, and other medical staff to ensure operational success of the humanitarian mission.",
        "Played a key role in enabling the delivery of vital healthcare services to a vulnerable refugee population."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Calabar",
      "location": "Calabar, Cross River State, Nigeria.",
      "url": "https://www.unical.edu.ng/",
      "degrees": [
        "Bachelor of Science in Biochemistry"
      ],
      "honors": [],
      "gpa_cumulative": "4.05",
      "gpa_major": "4.05",
      "graduation_date": "2016"
    },
    {
      "institution": "ALX Africa",
      "location": "Nairobi, Kenya",
      "url": "https://www.alxafrica.com/",
      "degrees": ["Certification in Software Engineering Programme"],
      "honors": [],
      "gpa_cumulative": "",
      "gpa_major": "",
      "graduation_date": "2025"
    }
  ],
  "skills": [
    {
      "name": "Python, Flask",
      "proficiency": 70,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "DevOps, Linux command line",
      "proficiency": 70,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "JavaScript, HTML, CSS",
      "proficiency": 75,
      "proficiency_label": "Comfortable"
    }
  ],
  "interests": [
    {
      "name": "FootBall",
      "summary": "",
      "images": [
        {
          "img_path": "portfolio_media/ronaldo.jpeg",
          "caption": "Ronaldo on the Ball"
        },
        {
          "img_path": "portfolio_media/osimen.jpeg",
          "caption": "Osimen on the Ball"
        }
      ]
    },
    {
      "name": "Travelling",
      "summary": "",
      "images": [
        {
          "img_path": "portfolio_media/traveller1.jpeg",
          "caption": "A Lone Traveller"
        },
        {
          "img_path": "portfolio_media/traveller2.jpeg",
          "caption": "A travelling Couple"
        }
      ]
    }
  ],
  "languages": [
    {"language" :"English languages", "fluency": "Native"}
  ],
  "references": [
    {
      "name": "Mr. Zakhele Shigonwe",
      "company": "Wancemo Pty",
      "url": "https://wancemo.co.za",
      "position": "Founder/CEO",
      "email": "zakhele@wastedump.co.za",
      "phone_no": ""
    },
    {
      "name": "Mr. Benjamin Joshua",
      "company": "Wancemo Pty",
      "url": "https://wancemo.co.za",
      "position": "Lead Engineer",
      "email": "benjamin@wastedump.co.za",
      "phone_no": "08107160494"
    },
    {
      "name": "Mr. Andrew Ushie",
      "company": "Evidence Action",
      "url": "https://www.evidenceaction.org/",
      "position": "Program Coordinator",
      "email": "andrew.ushie@evidenceaction.org",
      "phone_no": "08107160494"
    }
  ],
  "nav_links": [
    {"url": "/", "text": "Home", "is_current": true},
    {"url": "/resume.html", "text": "Resume", "is_resume": true},
    {"url": "#about", "text": "About"},
    {"url": "#projects", "text": "Projects"},
    {"url": "#contact", "text": "Contact"},
    {"url": "#experience", "text": "Work Experience"}
],
"resume_link": {
    "url": "/resume.html",
    "text": "Download PDF Resume"
  },
  "footer_links": [
    {"url": "/resume.html", "text": "Resume", "is_resume": true}
  ],
  "contact_form": {
    "enabled": true,
    "submit_url": "https://formspree.io/f/meokrjok"
  }
}
